/*
    The contents of this file are subject to the AROS Public License Version 1.1
    (the "License"); you may not use this file except in compliance with the License.
    You may obtain a copy of the License at http://www.aros.org/license.html

    Software distributed under the License is distributed on an "AS IS" basis,
    WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License
    for the specific language governing rights and limitations under the License.
*/

#include <exec/types.h>
#include <exec/ports.h>
#include <dos/dos.h>
#include <intuition/intuition.h>
#include <sys/types.h>
#include <netinet/in.h>
#include <sys/time.h>
#include <netdb.h>

#define MUI_OBSOLETE
#include <libraries/mui.h>

#include <libraries/gadtools.h>


#define MAX_QUEUED_MESSAGES         500
#define BUFFERSIZE                  30000
#define MAX_EVENTS                  16
#define DCC_RECV_BUFFERSIZE         10000

/*
 * ub   - UBYTE *
 * s    - STRPTR
 * cs   - CONST_STRTR
 * _3.1_AROSMOS4.x
 */

#ifdef __amigaos4__
typedef char *          c_in;
typedef char *          i_in;
typedef CONST_STRPTR    l_in;
typedef CONST_STRPTR    loc_in;
typedef CONST_STRPTR    _ub_cs;
typedef CONST_STRPTR    _s_cs;
#elif __MORPHOS__
typedef char *          c_in;
typedef UBYTE *         i_in;
typedef CONST_STRPTR    l_in;
typedef STRPTR          loc_in;
typedef CONST_STRPTR    _ub_cs;
typedef CONST_STRPTR    _s_cs;
#elif __AROS__
typedef char *          c_in;
typedef unsigned int *  i_in;
typedef CONST_STRPTR    l_in;
typedef CONST_STRPTR    loc_in;
typedef CONST_STRPTR    _ub_cs;
typedef CONST_STRPTR    _s_cs;
#else
typedef UBYTE *         c_in;
typedef unsigned char * i_in;
typedef STRPTR          l_in;
typedef STRPTR          loc_in;
typedef UBYTE *         _ub_cs;
typedef STRPTR          _s_cs;
#endif

struct XYMessage
{
    struct Message xy_Msg;
    int xy_Getline;
    int xy_QuitArexx;
    int xy_Sendtext;
};

struct ObjApp
{
    APTR    GROUP_ROOT_0, GROUP_ROOT_1, GR_top;

    APTR WI_change_nick;
    APTR LA_change_nick;
    APTR STR_change_nick;
    APTR BT_change_nick_change;
    APTR BT_change_nick_cancel;

    APTR GR_server_specific_user_prefs;
    APTR GR_click_user_list_buttons;
    APTR GR_user_list_buttons;
    APTR LV_user_list_buttons;
    APTR LV_user_list_buttons2;
    APTR STR_user_list_buttons_name;
    APTR STR_user_list_buttons_command;
    APTR LA_user_list_buttons_help;

    APTR LA_user_list_buttons_disable;
    APTR CH_user_list_buttons_disable;

    APTR LA_hide_channel_mode_gadgets;
    APTR CH_hide_channel_mode_gadgets;

    APTR LA_hide_joins_parts;
    APTR CH_hide_joins_parts;

    APTR BT_user_list_buttons_add;
    APTR BT_user_list_buttons_delete;
    APTR BT_user_list_buttons_move_up;
    APTR BT_user_list_buttons_move_down;

    //APTR LA_use_utf8;
    APTR LA_local_charset;
    APTR LA_remote_charset;

    APTR    App;
    APTR    WI_main;

    APTR    LV_tabs;

    APTR    WI_graphical_smileys_choose;
    APTR    GR_graphical_smileys_choose;

    APTR    smiley_choose_icon;

    APTR    WI_graphical_smileys_preview;
    APTR    LV_graphical_smileys_preview;
    APTR    BT_graphical_smileys_preview;
    //quit requester
    APTR    WI_quit;
    APTR    BT_quit_yes;
    APTR    BT_quit_no;

    //about window objects
    APTR    WI_about;
    APTR    TX_about;
    APTR    TX_about2;
    APTR    TX_about3;
    APTR    TX_about_old;
    APTR    wookiechat_img_obj;
    APTR    guru_meditation_img_obj;
    APTR    SETTINGS_ROOT;
    
    //This window pops up if you try to recieve a file that already exists
    APTR    WI_dcc_file_exists;
    APTR    TX_oldname;
    APTR    TX_newname;
    APTR    TX_oldsize;
    APTR    TX_newsize;
    APTR    TX_olddate;
    APTR    BT_dcc_resume;
    APTR    BT_dcc_overwrite;
    APTR    BT_dcc_rename;
    APTR    BT_dcc_abort;

    //DCC WINDOW BUTTONS AND OBJECTS
    APTR    WI_dcc;
    APTR    WI_dcc2;
    APTR    LV_dcc;
    APTR    BT_dcc_accept;
    APTR    BT_dcc_cancel;
    APTR    BT_dcc_remove;
    APTR    STR_dcc_PA_label_0;
    APTR    PA_dcc_label_0;
    APTR    DCC_Register_Grp;
    APTR    LV_send_dcc;
    APTR    BT_dcc_send_new;
    APTR    BT_dcc_send_reoffer;
    APTR    BT_dcc_send_cancel;
    APTR    BT_dcc_send_remove;
    APTR    LA_download_path;
    APTR    MN_;
    APTR    LA_upload_path;
    APTR    STR_dcc_PA_label_1;
    APTR    PA_dcc_label_1;
    APTR    LA_download_path2;
    APTR    TX_download_path;


    APTR    STR_usertext;
    APTR    TX_nickname;

    //server selection window
    APTR    WI_label_2;
    APTR    STR_nickname1;
    APTR    STR_nickname2;
    APTR    STR_nickname3;
    APTR    STR_realname;
    APTR    STR_username;
    
    APTR    STR_server_nickname1;
    APTR    STR_server_nickname2;
    APTR    STR_server_nickname3;
    APTR    STR_server_realname;
    APTR    STR_server_username;

    APTR    BT_addserver;
    APTR    BT_addgroup;
    APTR    BT_delete_server;
    APTR    BT_edit;
    APTR    BT_connect;
    APTR    BT_connect_tab;
    APTR    BT_perform;
    APTR    NLT_Servers;
    APTR    NLV_Servers;
    APTR    CH_display_server_win;
    APTR    LA_display_server_win;
    APTR CH_use_global;


   //edit window stuff follows
    APTR    WI_edit_server;
    APTR    STR_servername;
    APTR    STR_port;
    APTR    STR_pass;
    APTR    STR_autojoin;
    APTR    STR_nick_registration_command;
    APTR    LA_autojoin;
    APTR    LA_nick_registration_command;
    APTR    BT_acceptserver;
    APTR    BT_cancelserver;
    APTR    WI_edit_group;
    APTR    STR_groupname;
    APTR    BT_acceptgroup;
    APTR    BT_cancelgroup;

    APTR    GR_charsets;
    APTR    CYCLE_local_charset;
    APTR    CYCLE_remote_charset;
    //APTR      CH_use_utf8;

    APTR    CH_charset;

    APTR    CH_autoconnect;
    APTR    LA_autoconnect;

   //colour settings window prefs
    APTR    WI_colour_settings;
    APTR    PP_CSW_background;
    APTR    PP_CSW_nicklistbackground;
    APTR    PP_CSW_join;
    APTR    PP_CSW_part;
    APTR    PP_CSW_quit;
    APTR    PP_CSW_modes;
    APTR    PP_CSW_ctcp;
    APTR    PP_CSW_actions;
    APTR    PP_CSW_normal;
    APTR    PP_CSW_info;
    APTR    PP_CSW_owntext;
    APTR    PP_CSW_highlight;
    APTR    PP_CSW_notices;
    APTR    PP_CSW_invite; //13
    APTR    PP_CSW_kick;    //14
    APTR    PP_CSW_nickchange;  //15
    APTR    PP_CSW_topic;     //16
    APTR    PP_CSW_wallops;    //17
    APTR    PP_CSW_activity;     //18
    APTR    PP_CSW_chatactivity;  //19
    APTR    PP_CSW_highlightactivity; //20
    APTR    PP_CSW_nicklisttext; //21
    APTR    PP_CSW_listviewtabs_background; //22
    APTR    PP_CSW_listviewtabs_normaltext; //33

    APTR    BT_colour_settings_load;
    APTR    BT_colour_settings_apply;
    APTR    BT_colour_settings_save;
    APTR    BT_colour_settings_save_as;


   //main settings window
    APTR    SETTINGS_Register_Grp;
    APTR    WI_mainsettings;
    //APTR      CH_label_6;
    //APTR      CH_label_1;
    
    APTR     CH_autojoin_channels_when_kicked;
    APTR     CH_auto_open_query_tabs_when_msged;

    APTR    STR_label_3;
    APTR    CH_label_2;
    APTR    CH_label_3;
    APTR    STR_label_1;
    APTR    STR_label_2;
    APTR    STR_label_4;
    APTR    STR_label_5;
    APTR    CH_label_4;
    APTR    CH_label_5;
    APTR    STR_label_0;
    APTR    CH_label_0;
    APTR    PA_label_0;
    APTR    STR_PA_label_0;
    APTR    BT_label_0;
    APTR    BT_label_1;
    APTR    BT_label_2;
    APTR    BT_label_3;
    APTR    TX_highlight_label;
    APTR    STR_highlight_label;
    APTR    TX_how_many_lines_to_reload;
